Revit 2024 API
AreaReinforcement.AreaReinforcementType Property
 Retrieves the type of the Area Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public AreaReinforcementType AreaReinforcementType { get; }
Visual Basic
Public ReadOnly Property AreaReinforcementType As AreaReinforcementType
	Get
Visual C++
public:
property AreaReinforcementType^ AreaReinforcementType {
	AreaReinforcementType^ get ();
}
See Also
AreaReinforcement Class
Autodesk.Revit.DB.Structure Namespace